1s/ERP/Conf/Catalogs/Лико_СпособыПодготовкиМакета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Лико_СпособыПодготовкиМакета</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТехнологияПечати</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_ТехнологияПечати</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСпособа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РабочиеЦентры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>РабочийЦентр</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РабочиеЦентры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВидыСекций</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидСекции</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Лико_ВидыСекций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

1s/ERP/Conf/Catalogs/Лико_СпособыПодготовкиМакета/Ext/ManagerModule.bsl
Функция ПолучитьКодТехнологии(ЗаказКлиента) Экспорт  //+Лико m.shenderov 29.01.2024
	
	Результат="";
	Если Не ЗаказКлиента.НоменклатураDFM Тогда
		
		Возврат Результат;
		
	КонецЕсли;
	
	
	
	УстановитьПривилегированныйРежим(Истина);
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗаказКлиентаЦвета.ВидСекции КАК ВидСекции
	|ПОМЕСТИТЬ ВтВидыСекцийЗакза
	|ИЗ
	|	Документ.ЗаказКлиента.Цвета КАК ЗаказКлиентаЦвета
	|ГДЕ
	|	ЗаказКлиентаЦвета.Ссылка = &ЗаказКлиента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Лико_СпособыПодготовкиМакетаРабочиеЦентры.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВтСпособПодготовки
	|ИЗ
	|	Справочник.Лико_СпособыПодготовкиМакета.РабочиеЦентры КАК Лико_СпособыПодготовкиМакетаРабочиеЦентры
	|ГДЕ
	|	Лико_СпособыПодготовкиМакетаРабочиеЦентры.РабочийЦентр = &РабочийЦентр
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Лико_СпособыПодготовкиМакетаВидыСекций.Ссылка КАК Ссылка,
	|	МИНИМУМ(ВЫБОР
	|			КОГДА ВтВидыСекцийЗакза.ВидСекции ЕСТЬ NULL
	|				ТОГДА 0
	|			ИНАЧЕ 1
	|		КОНЕЦ) КАК ЕстьСекции,
	|	СУММА(ВЫБОР
	|			КОГДА ВтВидыСекцийЗакза.ВидСекции ЕСТЬ NULL
	|				ТОГДА 0
	|			ИНАЧЕ 1
	|		КОНЕЦ) КАК КоличествоСекций
	|ПОМЕСТИТЬ ВтСПМсУчетомВидаСекции
	|ИЗ
	|	ВтСпособПодготовки КАК ВтСпособПодготовки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Лико_СпособыПодготовкиМакета.ВидыСекций КАК Лико_СпособыПодготовкиМакетаВидыСекций
	|		ПО ВтСпособПодготовки.Ссылка = Лико_СпособыПодготовкиМакетаВидыСекций.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтВидыСекцийЗакза КАК ВтВидыСекцийЗакза
	|		ПО (ВтВидыСекцийЗакза.ВидСекции = Лико_СпособыПодготовкиМакетаВидыСекций.ВидСекции)
	|
	|СГРУППИРОВАТЬ ПО
	|	Лико_СпособыПодготовкиМакетаВидыСекций.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВтСПМсУчетомВидаСекции.Ссылка КАК Ссылка,
	|	ВтСПМсУчетомВидаСекции.Ссылка.Код КАК Код,
	|	ВтСПМсУчетомВидаСекции.КоличествоСекций КАК КоличествоСекций
	|ИЗ
	|	ВтСПМсУчетомВидаСекции КАК ВтСПМсУчетомВидаСекции
	|ГДЕ
	|	ВтСПМсУчетомВидаСекции.ЕстьСекции = 1
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВтСпособПодготовки.Ссылка,
	|	ВтСпособПодготовки.Ссылка.Код,
	|	NULL
	|ИЗ
	|	ВтСпособПодготовки КАК ВтСпособПодготовки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Лико_СпособыПодготовкиМакета.ВидыСекций КАК Лико_СпособыПодготовкиМакетаВидыСекций
	|		ПО ВтСпособПодготовки.Ссылка = Лико_СпособыПодготовкиМакетаВидыСекций.Ссылка
	|ГДЕ
	|	ВЫБОР
	|			КОГДА Лико_СпособыПодготовкиМакетаВидыСекций.Ссылка ЕСТЬ NULL
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	КоличествоСекций УБЫВ";
	Запрос.УстановитьПараметр("РабочийЦентр",ЗаказКлиента.РабочийЦентр ); 
	Запрос.УстановитьПараметр("ЗаказКлиента",ЗаказКлиента);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат=Выборка.Код;
		Возврат Результат;
	КонецЦикла; 
	
	Возврат Результат;	
	
КонецФункции //-Лико m.shenderov 29.01.2024
